#include <iostream>

using namespace std; 

int main()
{
	setlocale (LC_ALL , "rus");
	float A [100][100];
	int N; 
	float S_a , min;
	int i , j;
	cout << "\nВведите количество строк и столбцов в массиве\n>"; 
	cin >> N;
	//ввод массива
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < N; j++)
		{
			cout << "\nA [" << i << "," << j << "] = ";
			cin >> A[i][j];
		}
	} 
	//вывод исходного массива
	cout << "\n\nИсходный массив:"; 
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < N; j++)
		{
			cout << "\nA [" << i << "," << j << "] = " << A [i][j];
		}
	}
	//ср.арифметическое элементов главной и побочной диагонаей
	S_a = 0; 
	for (i = 0; i < N; i++)
	{
		S_a += A[i][i];
		S_a += A[i][N - i - 1];
	}
	S_a = S_a / (2*N);
	cout << "\n\nСреднее арифметическое равно: " << S_a; 
	
	//поиск минимума всего массива
	min = A[0][0];
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < N; j++)
		{
			if (A[i][j] < min) min = A[i][j];
		}
	}
	cout << "\nМинимум равен : " << min;

	//обработка элементов 
	for (i = 0 ; i < N ; i++)
		for (j = 0; j < N; j++)
		{
			//обработка элементов над побочной диагональю
			if (i + j < N-1 && A[i][j] > S_a) A[i][j] *= A[i][j];
			//обработка элементов под побочной диагональю
			else if (i + j >= N) A[i][j] += min; 
		}
	
	//вывод конечного массива
	cout << "\n\nКонечный массив:";
	for (i = 0; i < N; i++)
	{
		for (j = 0; j < N; j++)
		{
			cout << "\nA [" << i << "," << j << "] = " << A[i][j];
		}
	}
}